import math

# Ввод длины основы и высоты параллелограмма
base_length = float(input("Введите длину основы параллелограмма: "))
height = float(input("Введите высоту параллелограмма: "))

# Вычисление площади параллелограмма
area = base_length * height

# Вывод результата
print(f"Площадь параллелограмма: {area}")

'''Программа запрашивает пользователя ввести длину основы и высоту параллелограмма.
Вычисляется площадь параллелограмма по формуле: площадь = длина_основы * высота.
Результат выводится на экран, показывая площадь параллелограмма для введенных значений. 
В приведенном примере, при длине основы 5 и высоте 6, ожидаемый вывод будет Площадь параллелограмма: 30.0.'''